InformationRegisters/РСК_СообщенияСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РСК_СообщенияСМС</Name>
			<Comment>РС Консалт, Трофимов Евгений №19208, 25.07.2022 г.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстСМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDSms</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РСК_КодыСтатусовОтправкиСМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Баланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСК_СообщенияСМС/Ext/ManagerModule.bsl
// Отправляет СМС, записывает резуцльтат в РС. 
//Возвращает Истина при успешной отправке и Ложь при неудаче.
//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
//
// Параметры:
//  Номер			 - Строка - номер телефона на который будет отправлено СМС, формат желателен 7********** (первая 7 и 10цифр номера)
//  ТекстСообщения	 - Строка - текст сообщения 
//  Отправитель		 - Строка - кто будет отображаться у получателя в отправителе (ORTONICA или Reamed)
//  Получатель		 - СправочникСсылка.Партнеры - Получатель СМС
// 
Функция ОтправитьСМС (Номер, ТекстСообщения, Отправитель = "ORTONICA", Получатель) Экспорт 
	ПараметрыВозврата = Новый Структура;
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Истина; //Игнорировать регистр 
	RegExp.Global = Истина; //Поиск всех вхождений шаблона 
	RegExp.MultiLine = Истина; //Многострочный режим 
	RegExp.Pattern = "[^0-9]"; // отбор только чисел
	Номер = RegExp.Replace(Номер, ""); 
	Если СтрДлина(Номер) = 10 Тогда
		Номер = "7"+ Номер;
	КонецЕсли;
	Номер = Лев(Номер,11);
	Если Лев(Номер,1) = "8" Тогда
		Номер = "7"+Сред(Номер,2);
	КонецЕсли;
	
	Пока Найти(ТекстСообщения, "  ") > 0 Цикл
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "  ", " ");
	КонецЦикла;
	ТекстСообщения = СокрЛП(ТекстСообщения);
		
	ОтправительСМС = "&from="+Отправитель;
	//Отправка СМС в сервис SMS.ru
	
	Попытка
		ВремФайл 			 = ПолучитьИмяВременногоФайла("txt");
		HTTPСоединение = Новый HTTPСоединение("sms.ru",443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		HTTPЗапрос 	   = Новый HTTPЗапрос;
		HTTPЗапрос.АдресРесурса = "sms.ru/sms/send?api_id="+"E9228970-663C-3BCE-99AD-90AF2E37A6BF"+
		"&to="+Номер+ОтправительСМС+"&msg="+ТекстСообщения+"&json=1";	
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);    
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		Отправлено = ?(HTTPОтвет.КодСостояния = 200, Истина, Ложь);  
	Исключение
		Отправлено = Ложь;
	КонецПопытки;
	
	//Запись результата отправки СМС в регистр
	Запись = СоздатьМенеджерЗаписи(); 
	Запись.Период        = ТекущаяДата();
	Запись.Получатель    = Получатель; 
	Запись.НомерТелефона = Номер;
	
	Если Отправлено Тогда
		Отправлено = Ложь;
		ЧтениеДжейсон = Новый ЧтениеJSON;
		ЧтениеДжейсон.УстановитьСтроку(ТекстОтвета);
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьJSON(ЧтениеДжейсон);
		
		Если РСК_РаботаСоСтроками.СвойствоXDTO_Установлено(ОбъектXDTO, "balance") Тогда
			Запись.Баланс = ОбъектXDTO.balance;
		КонецЕсли;
		
		Если РСК_РаботаСоСтроками.СвойствоXDTO_Установлено(ОбъектXDTO, "sms") И
			 РСК_РаботаСоСтроками.СвойствоXDTO_Установлено(ОбъектXDTO.sms, Номер) Тогда

			смсXDTO = ОбъектXDTO.sms.Получить(Номер);
			Если смсXDTO.status = "OK" Тогда
				Запись.КодСтатуса = Справочники.РСК_КодыСтатусовОтправкиСМС.ПолучитьСсылкуНаКодСтатуса(
					смсXDTO.status_code
				);
				Запись.IDSms = смсXDTO.sms_id;
				Отправлено = Истина;
			Иначе
				Запись.КодСтатуса = Справочники.РСК_КодыСтатусовОтправкиСМС.ПолучитьСсылкуНаКодСтатуса(
					смсXDTO.status_code,
					смсXDTO.status_text
				);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запись.Отправлено    = Отправлено;
	Запись.ТекстСМС      = ТекстСообщения;
	Запись.Записать();
	
	Возврат Отправлено;
КонецФункции
